[
  {
    "id": 1,
    "title": "Spaghetti Carbonara",
    "image": "https://hips.hearstapps.com/hmg-prod/images/hdm-chickencorbonara-14753-1564436398.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=1200:*",
    "description": "A classic Italian pasta dish with bacon and cheese.",
    "ingredients": ["spaghetti", "bacon", "eggs", "cheese"],
    "instructions": [
      "Cook the spaghetti in a large pot of salted boiling water according to the package instructions until al dente. Reserve 1 cup of pasta water, then drain the spaghetti and set aside.",
      "While the spaghetti is cooking, heat a large skillet over medium heat. Add the chopped pancetta or bacon and cook until crisp and golden brown, about 5-6 minutes. Remove the cooked pancetta/bacon from the skillet and set aside.",
      "In the same skillet, add the minced garlic and cook for about 1 minute, or until fragrant. Be careful not to let it burn.",
      "In a separate bowl, whisk together the eggs and grated Parmesan cheese until well combined.",
      "Reduce the heat to low and return the cooked spaghetti to the skillet with the garlic. Toss to combine, then remove the skillet from the heat.",
      "Working quickly, pour the egg and cheese mixture over the hot spaghetti, tossing continuously to coat the pasta evenly. The residual heat from the spaghetti will cook the eggs and create a creamy sauce. If the sauce is too thick, add some of the reserved pasta water a little at a time until you reach your desired consistency.",
      "Season the spaghetti carbonara with salt and black pepper to taste. Be cautious with the salt as the pancetta/bacon and Parmesan cheese are already salty.",
      "Add the cooked pancetta/bacon back to the skillet and toss everything together.",
      "Serve the spaghetti carbonara immediately, garnished with extra grated Parmesan cheese and chopped fresh parsley if desired."
    ]
  },
  {
    "id": 2,
    "title": "Ceaser Salad",
    "image": "https://www.twopeasandtheirpod.com/wp-content/uploads/2023/04/Caesar-Salad-24.jpg",
    "description": "It's a popular salad with its simplicity and delicious taste.",
    "ingredients": [
      "1 head of romaine lettuce, washed and chopped",
      "1 cup of croutons",
      "1/2 cup grated Parmesan cheese",
      "Caesar dressing",
      "Anchovy fillets or anchovy paste"
    ],
    "instructions": [
      "In a large salad bowl, add the chopped romaine lettuce.",
      "Sprinkle the grated Parmesan cheese over the lettuce.",
      "Add the croutons to the salad bowl.",
      "Toss the salad gently to coat the lettuce, croutons, and Parmesan cheese evenly with the dressing.",
      "Enjoy your homemade Caesar Salad!"
    ]
  },
  {
    "id": 3,
    "title": "Apple Pie",
    "image": "https://preppykitchen.com/wp-content/uploads/2023/08/Apple-Pie-Recipe-Recipe-Card-500x500.jpg",
    "description": "Apple pie is a classic dessert that is loved by many.",
    "ingredients": [
      "6 cups peeled, cored, and thinly sliced apples",
      "3/4 cup granulated sugar",
      "2 tablespoons all-purpose flour",
      "1 teaspoon ground cinnamon",
      "1/4 teaspoon ground nutmeg",
      "1 tablespoon lemon juice",
      "2 tablespoons unsalted butter, cut into small pieces",
      "1 egg beaten with 1 tablespoon water",
      "Additional sugar, for sprinkling"
    ],
    "instructions": [
      "Preheat the oven to 375°F (190°C).",
      "Roll out half of the pie dough on a lightly floured surface to fit a 9-inch pie dish. Place the rolled-out dough into the bottom of the pie dish, and trim any excess dough from the edges. Set aside.",
      "In a large mixing bowl, combine the sliced apples, granulated sugar, flour, ground cinnamon, ground nutmeg, and lemon juice. Toss until the apples are evenly coated with the sugar and spice mixture.",
      "Pour the apple filling into the prepared pie crust, spreading it out evenly. Dot the top of the filling with the pieces of unsalted butter.",
      "Brush the top crust with the egg wash, and sprinkle with additional sugar if desired. Place the pie on a baking sheet to catch any drips, and bake in the preheated oven for 45 to 55 minutes, or until the crust is golden brown and the filling is bubbly.",
      "Enjoy this classic dessert with family and friends!"
    ]
  },
  {
    "id": 4,
    "title": "Egg Omlet",
    "image": "https://www.simplyrecipes.com/thmb/LLhiA8KZ7JZ5ZI0g-1bF1eg-gGM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2018__10__HT-Make-an-Omelet-LEAD-HORIZONTAL-17cd2e469c4a4ccbbd1273a7cae6425c.jpg",
    "description": "An egg omelette is a dish that can be enjoyed for breakfast",
    "ingredients": [
      "2 large eggs",
      "Salt and black pepper, to taste",
      "1 tablespoon butter or cooking oil",
      "Optional fillings: shredded cheese, diced vegetables (such as bell peppers, onions, tomatoes, spinach), cooked meats (such as ham, bacon, sausage), herbs (such as parsley, chives)"
    ],
    "instructions": [
      "Crack the eggs into a mixing bowl. Season with salt and black pepper, to taste. Use a fork or whisk to beat the eggs until well combined and slightly frothy.",
      "Place a non-stick skillet or frying pan over medium heat. Add the butter or cooking oil and allow it to melt or heat up until shimmering.",
      "Once the butter or oil is hot, pour the beaten eggs into the skillet, swirling the pan to evenly distribute the eggs across the surface.",
      "Sprinkle your desired fillings, such as shredded cheese, diced vegetables, cooked meats, or herbs, evenly over one half of the omelette.",
      "Slide the omelette onto a plate and serve immediately. Enjoy the delicious and satisfying flavors of this simple and versatile dish!"
    ]
  },
  {
    "id": 5,
    "title": "Grilled Lemon Herb Chicken",
    "image": "https://www.thechunkychef.com/wp-content/uploads/2021/09/Lemon-Herb-Grilled-Chicken-feat.jpg",
    "description": "Juicy and flavorful grilled chicken marinated in a tangy lemon herb sauce.",
    "ingredients": [
      "4 boneless, skinless chicken breasts",
      "1/4 cup olive oil",
      "2 cloves garlic, minced",
      "2 tablespoons fresh lemon juice",
      "1 tablespoon chopped fresh herbs (such as rosemary, thyme, or parsley)",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "In a small bowl, whisk together olive oil, minced garlic, lemon juice, chopped herbs, salt, and pepper.",
      "Place chicken breasts in a shallow dish and pour the marinade over them, turning to coat evenly. Cover and refrigerate for at least 30 minutes",
      "Preheat grill to medium-high heat. Grill chicken for 6-8 minutes per side, or until cooked through and juices run clear.",
      "Remove from grill and let rest for a few minutes before serving. Enjoy!"
    ]
  },
  {
    "id": 6,
    "title": "Blueberry Muffins",
    "image": "https://www.onceuponachef.com/images/2014/07/Best-Blueberry-Muffins-1.jpg",
    "description": "Soft and moist muffins bursting with juicy blueberries, perfect for breakfast or a snack.",
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "1/2 cup granulated sugar",
      "2 teaspoons baking powder",
      "1/2 teaspoon salt",
      "1/3 cup vegetable oil",
      "1 large egg",
      "1/3 cup milk",
      "1 teaspoon vanilla extract",
      "1 cup fresh or frozen blueberries"
    ],
    "instructions": [
      "Preheat the oven to 375°F (190°C). Line a muffin tin with paper liners or grease with cooking spray.",
      "In a large bowl, whisk together the flour, sugar, baking powder, and salt.",
      "In a separate bowl, beat together the vegetable oil, egg, milk, and vanilla extract until well combined.",
      "Add the wet ingredients to the dry ingredients and stir until just combined. Do not overmix.",
      "Gently fold in the blueberries.",
      "Divide the batter evenly among the muffin cups, filling each about 3/4 full.",
      "Bake for 18-20 minutes, or until the muffins are golden brown and a toothpick inserted into the center comes out clean.",
      "Allow the muffins to cool in the pan for a few minutes before transferring to a wire rack to cool completely. Enjoy!"
    ]
  },
  {
    "id": 7,
    "title": "Crispy Chicken Tenders",
    "image": "https://www.spendwithpennies.com/wp-content/uploads/2020/02/Crispy-Oven-Chicken-Tenders-SpendWithPennies-7.jpg",
    "description": "Crunchy and flavorful baked chicken tenders that are healthier than fried but just as tasty.",
    "ingredients": [
      "1 lb chicken tenders",
      "1 cup breadcrumbs",
      "1/4 cup grated Parmesan cheese",
      "1 teaspoon garlic powder",
      "1 teaspoon paprika",
      "1 teaspoon garlic powder",
      "Salt and pepper to taste",
      "1/4 cup melted butter or olive oil"
    ],
    "instructions": [
      "Preheat oven to 400°F (200°C). Line a baking sheet with parchment paper.",
      "In a shallow dish, combine breadcrumbs, Parmesan cheese, garlic powder, paprika, salt, and pepper.",
      "Dip each chicken tender into melted butter or olive oil, then coat with breadcrumb mixture, pressing gently to adhere.",
      "Place coated chicken tenders on the prepared baking sheet. Bake for 20-25 minutes, or until golden brown and cooked through. Serve with your favorite dipping sauce and enjoy!"
    ]
  },
  {
    "id": 8,
    "title": "Easy Baked Salmon",
    "image": "https://www.wholesomeyum.com/wp-content/uploads/2021/10/wholesomeyum-Baked-Salmon-Recipe-How-To-Cook-Salmon-In-The-Oven-1.jpg",
    "description": "Simple and delicious baked salmon with a flavorful herb and lemon seasoning.",
    "ingredients": [
      "4 salmon fillets",
      "2 tablespoons olive oil",
      "2 cloves garlic, minced",
      "1 tablespoon chopped fresh dill",
      "1 tablespoon chopped fresh parsley",
      "1 teaspoon lemon zest",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "Preheat oven to 375°F (190°C). Line a baking sheet with parchment paper.",
      "In a small bowl, combine olive oil, minced garlic, chopped dill, chopped parsley, lemon zest, salt, and pepper.",
      "Place salmon fillets on the prepared baking sheet. Brush the herb and lemon mixture over the salmon.",
      "Bake for 12-15 minutes, or until salmon is cooked through and flakes easily with a fork. Serve with lemon wedges and enjoy!"
    ]
  },
  {
    "id": 9,
    "title": "Banana Nut Muffins",
    "image": "https://i0.wp.com/lindasbakskola.se/app/uploads/sites/4/2021/10/IMG_4838.jpg?resize=926%2C1024&ssl=1",
    "description": "Moist and flavorful muffins made with ripe bananas and crunchy walnuts. ",
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "1 teaspoon baking powder",
      "1/2 teaspoon baking soda",
      "1/4 teaspoon salt",
      "3 ripe bananas, mashed",
      "1/2 cup granulated sugar",
      "1/4 cup unsalted butter, melted",
      "1 large egg",
      "1 teaspoon vanilla extract",
      "1/2 cup chopped walnuts"
    ],
    "instructions": [
      "Preheat the oven to 375°F (190°C). Line a muffin tin with paper liners or grease with cooking spray.",
      "In a large bowl, whisk together the flour, baking powder, baking soda, and salt.",
      "In a separate bowl, mix together the mashed bananas, sugar, melted butter, egg, and vanilla extract until well combined.",
      "Add the wet ingredients to the dry ingredients and stir until just combined. Do not overmix.",
      "Gently fold in the chopped walnuts.",
      "Divide the batter evenly among the muffin cups, filling each abou 3/4 full.",
      "Bake for 20-25 minutes, or until the muffins are golden brown and a toothpick inserted into the center comes out clean.",
      "Allow the muffins to cool in the pan for a few minutes before transferring to a wire rack to cool completely."
    ]
  },
  {
    "id": 10,
    "title": "Pancake",
    "image": "https://www.allrecipes.com/thmb/pZtxkWhiaZdUmdhgv-Pj9EIMbVY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/45396-easy-pancakes-DDMFS-4x3-44411f993d7841d9b2b89bcc65bdd178.jpg",
    "description": "Pancakes are a classic breakfast or brunch dish enjoyed by people of all ages.",
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "2 tablespoons granulated sugar",
      "1 teaspoon baking powder",
      "1/2 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1 cup milk",
      "1 large egg",
      "2 tablespoons unsalted butter, melted",
      "Butter or cooking oil, for greasing the pan",
      "Optional toppings: maple syrup, fresh fruit, whipped cream, chocolate chips, nuts"
    ],
    "instructions": [
      "In a large bowl, whisk together the flour, sugar, baking powder, baking soda, and salt.",
      "In a separate bowl, whisk together the milk, egg, and melted butter.",
      "Add the wet ingredients to the dry ingredients and stir until just combined. The batter may be slightly lumpy, which is okay. Do not overmix.",
      "Preheat a non-stick skillet or griddle over medium heat. Lightly grease the skillet with butter or cooking oil.",
      "Pour 1/4 cup of batter onto the skillet for each pancake. Cook until bubbles form on the surface of the pancake and the edges look set, about 2-3 minutes.",
      "Flip the pancake and cook for an additional 1-2 minutes, or until golden brown and cooked through.",
      "Transfer the cooked pancakes to a plate and keep warm. Repeat with the remaining batter, greasing the skillet as needed.",
      "Serve the pancakes warm with your favorite toppings, such as maple syrup, fresh fruit, whipped cream, chocolate chips, or nuts. Enjoy!"
    ]
  },
        {
          "id": 11,
          "title": "Roasted Potatos",
          "image": "https://www.wellplated.com/wp-content/uploads/2023/09/Best-Crispy-Roasted-Potatoes.jpg",
          "description": "Roasted potatoes are a classic side dish that pairs well with a variety of main courses.",
          "ingredients": ["1 pound (about 450g) potatoes ", 
          "2 tablespoons olive oil", 
          "1 teaspoon garlic powder", 
          "1 teaspoon paprika", 
          "1/2 teaspoon dried thyme",
          "1/2 teaspoon dried rosemaryr",
          "Salt and black pepper, to taste",
          "Fresh parsley, chopped (for garnish, optional)"
          ],
          "instructions": [
            "Preheat your oven to 425°F (220°C). Line a baking sheet with parchment paper or aluminum foil for easy cleanup.",
            "Cut the potatoes into bite-sized cubes or wedges, depending on your preference. Try to cut the potatoes into uniform pieces to ensure even cooking.",
            "Place the diced potatoes in a large mixing bowl. Drizzle the olive oil over the potatoes, then sprinkle with garlic powder, paprika, dried thyme, dried rosemary, salt, and black pepper.",
            "Toss the potatoes until they are evenly coated with the oil and seasonings.",
          "Spread the seasoned potatoes in a single layer on the prepared baking sheet, making sure they are not overcrowded. ",
          "Place the baking sheet in the preheated oven and roast the potatoes for 25-30 minutes ",
          "Once the potatoes are roasted to perfection, remove them from the oven and transfer them to a serving dish."]
        },
        {
          "id": 12,
          "title": "Greek Salad",
          "image": "https://www.thechunkychef.com/wp-content/uploads/2021/07/Greek-Salad-Recipe-recipe-card.jpg",
          "description": "Greek salad, is a refreshing and vibrant dish that showcases the flavors ofther Mediterranean.",
          "ingredients": ["2 large tomatoes, cut into wedges", 
          "1 cucumber, sliced", 
          "1 red onion, thinly sliced", 
          "1 green bell pepper, seeded and sliced", 
          "1/2 cup Kalamata olives, pitted",
          "1/2 cup feta cheese, crumbled",
          "2 tablespoons extra virgin olive oil",
          "1 teaspoon dried oregano",
          "Salt and black pepper, to taste",
          "Fresh parsley, chopped "],
          "instructions": [
            "Wash and prepare the tomatoes, cucumber, red onion, and green bell pepper as directed. Cut the tomatoes into wedges, slice the cucumber, thinly slice the red onion, and seed and slice the green bell pepper.", 
             "In a large mixing bowl, combine the tomato wedges, sliced cucumber, sliced red onion, sliced green bell pepper, and Kalamata olives. Toss the vegetables gently to combine.",
            "Sprinkle the crumbled feta cheese over the top of the salad.",
          "In a small bowl, whisk together the extra virgin olive oil, red wine vinegar, dried oregano, salt, and black pepper until well combined. Adjust the seasoning to taste, if needed.",
          "Gently toss the salad to coat the vegetables evenly with the dressing.",
          "Transfer the Greek salad to a serving platter or individual salad bowls. Garnish with chopped fresh parsley, if desired, for added flavor and presentation.",
          "Enjoy the vibrant flavors and textures of this classic Greek salad!"]
        }
    
  ]
  